using System;
using System.Collections.Generic;
using System.Linq;
using System.Net.Http;
using System.Web.Http;
using System.Runtime.Serialization;
using Timetable.Site.DataService;
using Timetable.Site.Models.ScheduleInfoes;

namespace Timetable.Site.Controllers.Api
{
    public partial class ScheduleController : BaseApiController<Schedule>
    {
        public Schedule[] GetTempSchedulesForGroup(Group g)
        {
            var result = new List<Schedule>();
            if (g.Id == 22105)
            {
                //day1
                result.Add(CreateSchedule(
                        1,"Л",
                        "Физическая культура",
                        "Ульнырова Н.Ю.",
                        "п", -1, 1,
                        "22105",
                        "1",
                        1,1,//day, period
                        1,1,0
                    ));
                result.Add(CreateSchedule(
                       1, "Л",
                       "Математика-1",
                       "Кручек М.М.",
                       "л", 250, 1,
                       "22105",
                       "1",
                       1, 4,//day, period
                       1, 1, 0
                   ));
                result.Add(CreateSchedule(
                       1, "Л",
                       "Архитектура ЭВМ",
                       "Богоявленский Ю.А.   ",
                       "л", 152, 1,
                       "22105",
                       "1",
                       1, 5,//day, period
                       1, 1, 0
                   ));
                result.Add(CreateSchedule(
                       1, "Ч",
                       "Информатика ",
                       "Колосов А.С.",
                       "лаб", 435, 1,
                       "22105",
                       "1",
                       1, 6,//day, period
                       1, 1, 0
                   ));
                result.Add(CreateSchedule(
                       1, "З",
                       " Информатика",
                       "Димитров В.М.",
                       "лаб", 435, 1,
                       "22105",
                       "1",
                       1, 6,//day, period
                       1, 1, 0
                   ));
                //day2
                result.Add(CreateSchedule(
                     1, "Л",
                     "Иностранный язык",
                     "Чепурина И.В.",
                     "п", 420, 1,
                     "22105",
                     "1",
                     2, 2,//day, period
                     1, 1, 0
                 ));
                result.Add(CreateSchedule(
                     1, "Л",
                     "Информатика",
                     "Соколов А.В.",
                     "л", 152, 1,
                     "22105",
                     "1",
                     2, 3,//day, period
                     1, 1, 0
                 ));
                result.Add(CreateSchedule(
                     1, "Ч",
                     "Право",
                     "Бойченко Л.Д.",
                     "п", 352, 1,
                     "22105",
                     "1",
                     2, 4,//day, period
                     1, 1, 0
                 ));
                result.Add(CreateSchedule(
                     1, "Л",
                     "Право ",
                     "Бойченко Л.Д.",
                     "л", 152, 1,
                     "22105",
                     "1",
                     2, 5,//day, period
                     1, 1, 0
                 ));
                result.Add(CreateSchedule(
                     1, "З",
                     " Информатика",
                     "Крышень М.А.",
                     "лаб", 435, 1,
                     "22105",
                     "1",
                     2, 6,//day, period
                     1, 1, 0
                 ));

                //day3
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Гаврилова А.Н.",
                    "п", 350, 1,
                    "22105",
                    "1",
                    3, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    " Информатика",
                    "Чистяков Д.Б.",
                    "лаб", 341, 1,
                    "22105",
                    "1",
                    3, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Чепурина И.В.",
                    "п", 402, 1,
                    "22105",
                    "1",
                    3, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Математика-3",
                    "Воронов Р.В.",
                    "п", 305, 1,
                    "22105",
                    "1",
                    3, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Технология программирования",
                    "Воронов Р.В.",
                    "лаб", 239, 1,
                    "22105",
                    "1",
                    3, 6,//day, period
                    1, 1, 0
                ));


                //day4
                result.Add(CreateSchedule(
                    1, "Л",
                    "Физическая культура",
                    "Ульнырова Н.Ю.",
                    "п", -1, 1,
                    "22105",
                    "1",
                    4, 1,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Математика-1",
                    "Шибаева И.Т.",
                    "п", 412, 1,
                    "22105",
                    "1",
                    4, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Информатика",
                    " Аксёнова Е.А.",
                    "лаб", 341, 1,
                    "22105",
                    "1",
                    4, 5,//day, period
                    1, 1, 0
                ));
           
                result.Add(CreateSchedule(
                    1, "Л",
                    "Архитектура ЭВМ",
                    "Чистяков Д.Б.",
                    "лаб", 435, 1,
                    "22105",
                    "1",
                    4, 6,//day, period
                    1, 1, 0
                ));

                //day5
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Технология программирования",
                    "Воронов Р.В.",
                    "лаб", 239, 1,
                    "22105",
                    "1",
                    5, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык ",
                    "Никифорова О.В.",
                    "п", 348, 1,
                    "22105",
                    "1",
                    5, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Математика-3",
                    "Воронов Р.В.",
                    "л", 152, 1,
                    "22105",
                    "1",
                    5, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Технология программирования",
                    "Горинов Н.А.",
                    "л", 152, 1,
                    "22105",
                    "1",
                    5, 6,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Информатика",
                    "Бородин А.В.",
                    "л", 146, 1,
                    "22105",
                    "1",
                    5, 6,//day, period
                    1, 1, 0
                ));

                //day6

     
                //day7
            }

            if (g.Id == 22205)
            {
                //day1
                result.Add(CreateSchedule(
                   1, "Л",
                   "Управление ИТ-сервисами и контентом",
                   "Жуков А.В.",
                   "л", 152, 1,
                   "22205",
                   "1",
                   1, 2,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Иностранный язык",
                   "Гаврилова А.Н.",
                   "лаб", 350, 1,
                   "22205",
                   "1",
                   1, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Управление данными",
                   "Щеголева Л.В.",
                   "л", 146, 1,
                   "22205",
                   "1",
                   1, 4,//day, period
                   1, 1, 0
               ));
           

                //day2
                result.Add(CreateSchedule(
                   1, "Л",
                   "Управление данными",
                   "Ивашко Е.Е.",
                   "лаб", 241, 1,
                   "22205",
                   "1",
                   2, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Компьютерные сети",
                   "Чистяков Д.Б.",
                   "лаб", 435, 1,
                   "22205",
                   "1",
                   2, 5,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Управление данными",
                    "Ивашко Е.Е.",
                    "лаб", 241, 1,
                    "22205",
                    "1",
                    2, 6,//day, period
                    1, 1, 0
                ));
                //day3
                result.Add(CreateSchedule(
                    1, "Л",
                    "Компьютерные сети",
                    "Пономарев В.А.",
                    "л", 146, 1,
                    "22205",
                    "1",
                    3, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Физика",
                    "Вагнер Л.С.",
                    "п", 352, 1,
                    "22205",
                    "1",
                    3, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Физика",
                    "Вагнер Л.С.",
                    "л", 352, 1,
                    "22205",
                    "1",
                    3, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Информационная безопасность и защита информации",
                    "Смолий Ю.А.",
                    "п", 241, 1,
                    "22205",
                    "1",
                    3, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Информационная безопасность и защита информации",
                    "Смолий Ю.А.",
                    "п", 241, 1,
                    "22205",
                    "1",
                    3, 6,//day, period
                    1, 1, 0
                ));
                //day4
                result.Add(CreateSchedule(
                    1, "Л",
                    "Физика",
                    "Вагнер Л.С.",
                    "лаб", 246, 1,
                    "22205",
                    "1",
                    4, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Никифорова О.В.",
                    "лаб", 348, 1,
                    "22205",
                    "1",
                    4, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Бердышева М.Ю.",
                    "лаб", 450, 1,
                    "22205",
                    "1",
                    4, 4,//day, period
                    1, 1, 0
                ));
                //day5
                result.Add(CreateSchedule(
                    1, "Л",
                    "Философия",
                    "Кабанова Л.И.",
                    "л", 352, 1,
                    "22205",
                    "1",
                    5, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Философия",
                    "Кабанова Л.И.",
                    "п", 265, 1,
                    "22205",
                    "1",
                    5, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Информационная безопасность и защита информации",
                    " ",
                    "л", 305, 1,
                    "22205",
                    "1",
                    5, 6,//day, period
                    1, 1, 0
                ));

                //day6
                result.Add(CreateSchedule(
                    1, "Л",
                    "Математика-4",
                    "Некрасов М.Ю.",
                    "л", 405, 1,
                    "22205",
                    "1",
                    6, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Математика-4",
                    "Некрасов М.Ю.",
                    "л", 405, 1,
                    "22205",
                    "1",
                    6, 3,//day, period
                    1, 1, 0
                ));

                //day7
            }

            if (g.Id == 22206)
            {
                //day1--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Управление ИТ-сервисами и контентом",
                    "Жуков А.В.",
                    "л", 152, 1,
                    "22206",
                    "1",
                    1, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Никифорова О.В.",
                    "лаб", 348, 1,
                    "22206",
                    "1",
                    1, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Управление данными",
                    "Щеголева Л.В.",
                    "л", 146, 1,
                    "22206",
                    "1",
                    1, 4,//day, period
                    1, 1, 0
                ));
                //day2--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Управление данными",
                    "Ивашко Е.Е.",
                    "лаб", 241, 1,
                    "22206",
                    "1",
                    2, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Компьютерные сети",
                    "Чистяков Д.Б.",
                    "лаб", 435, 1,
                    "22206",
                    "1",
                    2, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Управление данными",
                    " Ивашко Е.Е.",
                    "лаб", 241, 1,
                    "22206",
                    "1",
                    2, 6,//day, period
                    1, 1, 0
                ));
                //day3--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Компьютерные сети",
                    "Пономарев В.А.",
                    "л", 146, 1,
                    "22206",
                    "1",
                    3, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Физика",
                    "Вагнер Л.С.",
                    "п", 352, 1,
                    "22206",
                    "1",
                    3, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Физика",
                    "Вагнер Л.С.",
                    "л", 241, 1,
                    "352",
                    "1",
                    3, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Информационная безопасность и защита информации",
                    " Смолий Ю.А.",
                    "п", 241, 1,
                    "22206",
                    "1",
                    3, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Информационная безопасность и защита информации",
                    "Смолий Ю.А.",
                    "п", 241, 1,
                    "22206",
                    "1",
                    3, 6,//day, period
                    1, 1, 0
                ));
                //day4--------------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Физика",
                   "Вагнер Л.С.",
                   "лаб", 434, 1,
                   "22206",
                   "1",
                   4, 2,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Компьютерные сети",
                    "Санников А.А.",
                    "лаб", 435, 1,
                    "22206",
                    "1",
                    4, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                   1, "З",
                   "Компьютерные сети",
                   "Санников А.А.",
                   "лаб", 435, 1,
                   "22206",
                   "1",
                   4, 4,//day, period
                   1, 1, 0
               ));
                //day5--------------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Философия",
                   "Кабанова Л.И.",
                   "л", 352, 1,
                   "22206",
                   "1",
                   5, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Философия",
                    "Кабанова Л.И.",
                    "п", 265, 1,
                    "22206",
                    "1",
                    5, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Информационная безопасность и защита информации",
                   " ",
                   "л", 305, 1,
                   "22206",
                   "1",
                   5, 6,//day, period
                   1, 1, 0
               ));
                //day6--------------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Математика-4",
                   " ",
                   "п", 405, 1,
                   "22206",
                   "1",
                   6, 2,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Математика-4",
                    " ",
                    "л", 405, 1,
                    "22206",
                    "1",
                    6, 3,//day, period
                    1, 1, 0
                ));
            }

            if (g.Id == 22305)
            {
                //day1--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Проектирование информационных систем",
                    "Щеголева Л.В.",
                    "л", 356, 1,
                    "22305",
                    "1",
                    1, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Прикладные методы оптимизации",
                    "Воропаев А.Н.",
                    "п", 239, 1,
                    "22305",
                    "1",
                    1, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Колосов А.С.",
                    "п", 146, 1,
                    "22305",
                    "1",
                    1, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Метрология,стандартизация и сертификация",
                    "Ильин А.М.",
                    "л", 401, 1,
                    "22305",
                    "1",
                    1, 6,//day, period
                    1, 1, 0
                ));
                //day2------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Димитров В.М.",
                    "лаб", 341, 1,
                    "22305",
                    "1",
                    2, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Прикладные методы оптимизации",
                    "Сошкин Р.В.",
                    "л", 427, 1,
                    "22305",
                    "1",
                    2, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Web - технологии",
                    "Дмитриев В.В.",
                    "лаб", 341, 1,
                    "22305",
                    "1",
                    2, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Прикладные методы оптимизации",
                    "Воропаев А.Н.",
                    "п", 254, 1,
                    "22305",
                    "1",
                    2, 6,//day, period
                    1, 1, 0
                ));
                //day3--------------------------------------------

                //day4-------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Димитров В.М.",
                    "лаб", 341, 1,
                    "22305",
                    "1",
                    4, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Прикладная статистика",
                    " ",
                    "л", 427, 1,
                    "22305",
                    "1",
                    4, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Прикладная статистика",
                    " ",
                    "лаб", 427, 1,
                    "22305",
                    "1",
                    4, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Тервинская Ю.В.",
                    "лаб", 209, 1,
                    "22305",
                    "1",
                    4, 6,//day, period
                    1, 1, 0
                ));
                //day5--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Колосов А.С.",
                    "лаб", 138, 1,
                    "22305",
                    "1",
                    5, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Web - технологии",
                    "Бородина А.В.",
                    "л", 146, 1,
                    "22305",
                    "1",
                    5, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Железовская Ю.В.",
                    "лаб", 420, 1,
                    "22305",
                    "1",
                    5, 5,//day, period
                    1, 1, 0
                ));
                //day6------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Основы теории управления",
                    "Клюкина Е.А.",
                    "л", 274, 1,
                    "22305",
                    "1",
                    6, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Основы теории управления",
                    "Клюкина Е.А.",
                    "л", 274, 1,
                    "22305",
                    "1",
                    6, 4,//day, period
                    1, 1, 0
                ));
               
            }

            if (g.Id == 22306)
            {
                //day1--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Проектирование информационных систем",
                    "Щеголева Л.В.",
                    "л", 356, 1,
                    "22306",
                    "1",
                    1, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Web - технологии",
                    " ",
                    "лаб", 435, 1,
                    "22306",
                    "1",
                    1, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Проектирование информационных систем",
                    "Воронова А.М.",
                    "лаб", 138, 1,
                    "22306",
                    "1",
                    1, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Колосов А.С.",
                    "п", 146, 1,
                    "22306",
                    "1",
                    1, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Метрология,стандартизация и сертификация",
                    "Ильин А.М.",
                    "л", 401, 1,
                    "22306",
                    "1",
                    1, 6,//day, period
                    1, 1, 0
                ));
                //day2-------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Колосов А.С.",
                    "лаб", 241, 1,
                    "22306",
                    "1",
                    2, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Димитров В.М.",
                    "лаб", 341, 1,
                    "22306",
                    "1",
                    2, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Прикладные методы оптимизации",
                    "Сошкин Р.В.",
                    "л", 427, 1,
                    "22306",
                    "1",
                    2, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Прикладные методы оптимизации",
                    "Воропаев А.Н.",
                    "лаб", 239, 1,
                    "22306",
                    "1",
                    2, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Миранцова А.В.",
                    "лаб", 265, 1,
                    "22306",
                    "1",
                    2, 6,//day, period
                    1, 1, 0
                ));
                //day3--------------------------------------------
                //day4--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Димитров В.М.",
                    "лаб", 341, 1,
                    "22306",
                    "1",
                    4, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Димитров В.М.",
                    "лаб", 341, 1,
                    "22306",
                    "1",
                    4, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Прикладная статистика",
                    " ",
                    "л", 427, 1,
                    "22306",
                    "1",
                    4, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Никифорова О.В.",
                    "лаб", 348, 1,
                    "22306",
                    "1",
                    2, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Прикладная статистика",
                    " ",
                    "лаб", 241, 1,
                    "22306",
                    "1",
                    4, 6,//day, period
                    1, 1, 0
                ));
                //day5--------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Колосов А.С. ",
                    "лаб", 138, 1,
                    "22306",
                    "1",
                    5, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Практикум по технологии производства программного обеспечения",
                    "Колосов А.С.",
                    "лаб", 138, 1,
                    "22306",
                    "1",
                    5, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Web - технологии",
                    "Бородина А.В. ",
                    "л", 146, 1,
                    "22306",
                    "1",
                    5, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Прикладные методы оптимизации",
                    "Воропаев А.Н.",
                    "п", 412, 1,
                    "22306",
                    "1",
                    5, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Web - технологии",
                    " ",
                    "лаб", 435, 1,
                    "22306",
                    "1",
                    5, 6,//day, period
                    1, 1, 0
                ));
                //day6-------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Основы теории управления",
                    "Клюкина Е.А.",
                    "л", 274, 1,
                    "22306",
                    "1",
                    6, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Основы теории управления",
                    "Клюкина Е.А.",
                    "л", 274, 1,
                    "22306",
                    "1",
                    6, 4,//day, period
                    1, 1, 0
                ));
            }

            if (g.Id == 22108)
            {
                //day1-------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Физическая культура",
                    "Ульнырова Н.Ю.",
                    "п", -1, 1,
                    "22108",
                    "1",
                    1, 1,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Математический анализ",
                    "Кручек М.М.",
                    "л", 250, 1,
                    "22108",
                    "1",
                    1, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Иностранный язык",
                    "Нагайцева Н.Н.",
                    "лаб", 436, 1,
                    "22108",
                    "1",
                    1, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Вычислительные системы и телекоммуникации",
                    "Москин Н.Д.",
                    "л", 305, 1,
                    "22108",
                    "1",
                    1, 6,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Вычислительные системы и телекоммуникации",
                    "Москин Н.Д. ",
                    "лаб", 305, 1,
                    "22108",
                    "1",
                    1, 6,//day, period
                    1, 1, 0
                ));
               
                //day2-------------------------------------------
                result.Add(CreateSchedule(
                    1, "З",
                    "Право",
                    "Бойченко Л.Д.",
                    "п", 352, 1,
                    "22108",
                    "1",
                    2, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Офисные технологии",
                    "Перепечко С.Н.",
                    "п", 305, 1,
                    "22108",
                    "1",
                    2, 5,//day, period
                    1, 1, 0
                ));

                //day3--------------------------------------------
                //day4-------------------------------------------
                result.Add(CreateSchedule(
                    1, "Л",
                    "Физическая культура",
                    "Ульнырова Н.Ю.",
                    "п", -1, 1,
                    "22108",
                    "1",
                    4, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Дискретная математика",
                    "Воронов Р.В.",
                    "п", 403, 1,
                    "22108",
                    "1",
                    4, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Программирование",
                    " Воронов Р.В.",
                    "лаб", 239, 1,
                    "22108",
                    "1",
                    4, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Программирование",
                    "Воронов Р.В.",
                    "лаб", 239, 1,
                    "22108",
                    "1",
                    4, 6,//day, period
                    1, 1, 0
                ));
              
                //day5--------------------------------------------
                result.Add(CreateSchedule(
                    1, "З",
                    "Математический анализ",
                    "Крупко Н.С.",
                    "п", 258, 1,
                    "22108",
                    "1",
                    5, 3,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Микроэкономика",
                    "Рудаков М.Н.",
                    "л", 403, 1,
                    "22108",
                    "1",
                    5, 4,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Л",
                    "Дискретная математика",
                    "Воронов Р.В.",
                    "л", 152, 1,
                    "22108",
                    "1",
                    5, 5,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Программирование",
                    "Горинов Н.А.",
                    "л", 152, 1,
                    "22108",
                    "1",
                    5, 6,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Микроэкономика",
                    "Рудаков М.Н.",
                    "п", 403, 1,
                    "22108",
                    "1",
                    5, 6,//day, period
                    1, 1, 0
                ));
                //day6-------------------------------------------
                result.Add(CreateSchedule(
                    1, "Ч",
                    "Общая теория систем",
                    "Клюкина Е.А.",
                    "л", 274, 1,
                    "22108",
                    "1",
                    6, 2,//day, period
                    1, 1, 0
                ));
                result.Add(CreateSchedule(
                    1, "З",
                    "Общая теория систем",
                    "Клюкина Е.А.",
                    "п", 274, 1,
                    "22108",
                    "1",
                    6, 2,//day, period
                    1, 1, 0
                ));
            }

            if (g.Id == 22208)
            {
                //day1-----------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Управление ИТ-сервисами и контентом ",
                   "Жуков А.В.",
                   "л", 152, 1,
                   "22208",
                   "1",
                   1, 2,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Ч",
                   "Иностранный язык",
                   "Копцева Т.А.",
                   "п", 353, 1,
                   "22208",
                   "1",
                   1, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "З",
                   "Иностранный язык",
                   "Копцева Т.А.",
                   "п", 407, 1,
                   "22208",
                   "1",
                   1, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Базы данных 1",
                   "Щеголева Л.В.",
                   "л", 146, 1,
                   "22208",
                   "1",
                   1, 4,//day, period
                   1, 1, 0
               ));
                //day2------------------------------------------
                result.Add(CreateSchedule(
                   1, "З",
                   "Базы данных 1",
                   "Соколов В.Е.",
                   "п", 239, 1,
                   "22208",
                   "1",
                   2, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Ч",
                   "Право",
                   "Арбузов С.Ю.",
                   "л", 304, 1,
                   "22208",
                   "1",
                   2, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Иностранный язык",
                   "Гаврилова А.Н.",
                   "п", 350, 1,
                   "22208",
                   "1",
                   2, 5,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Управление ИТ-сервисами и контентом",
                   "Жуков А.В.",
                   "п", 239, 1,
                   "22208",
                   "1",
                   2, 6,//day, period
                   1, 1, 0
               ));
                //day3------------------------------------------
                //day4-----------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Иностранный язык",
                   "Гаврилова А.Н.",
                   "п", 350, 1,
                   "22208",
                   "1",
                   4, 2,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Ч",
                   "Право",
                   "Арбузов С.Ю.",
                   "л", 355, 1,
                   "22208",
                   "1",
                   4, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "З",
                   "Право",
                   "Арбузов С.Ю.",
                   "п", 355, 1,
                   "22208",
                   "1",
                   4, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Деловые коммуникации",
                   "Рогова О.Б.",
                   "п", 152, 1,
                   "22208",
                   "1",
                   4, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Электронный бизнес",
                   "Марахтанов А.Г.",
                   "п", 265, 1,
                   "22208",
                   "1",
                   4, 5,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Иностранный язык",
                   "Копцева Т.А.",
                   "п", 420, 1,
                   "22208",
                   "1",
                   4, 6,//day, period
                   1, 1, 0
               ));
                //day5------------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Иностранный язык",
                   "Железовская Ю.В. ",
                   "п", 420, 1,
                   "22208",
                   "1",
                   5, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Управленческие решения",
                   "Рудаков М.Н.",
                   "п", 403, 1,
                   "22208",
                   "1",
                   5, 5,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Ч",
                   "Теория вероятностей",
                   "Спиридонов К.Н.",
                   "п", 403, 1,
                   "22208",
                   "1",
                   5, 6,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "З",
                   "Теория вероятностей",
                   "Спиридонов К.Н.",
                   "п", 403, 1,
                   "22208",
                   "1",
                   5, 6,//day, period
                   1, 1, 0
               ));
                //day6------------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Теория вероятностей",
                   "Некрасов М.Ю.",
                   "л", 405, 1,
                   "22208",
                   "1",
                   6, 2,//day, period
                   1, 1, 0
               ));
            }

            if (g.Id == 22308)
            {
                //day1-----------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Проектирование информационных систем",
                   "Щеголева Л.В.",
                   "л", 356, 1,
                   "22308",
                   "1",
                   1, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Хранилища данных (банки данных)",
                   "Савченко О.Н.",
                   "лаб", 241, 1,
                   "22308",
                   "1",
                   1, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Хранилища данных (банки данных)",
                   " ",
                   "л", 411, 1,
                   "22308",
                   "1",
                   1, 5,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Метрология,стандартизация и сертификация",
                   "Ильин А.М.",
                   "л", 401, 1,
                   "22308",
                   "1",
                   1, 6,//day, period
                   1, 1, 0
               ));
               
                //day2-----------------------------------------
                result.Add(CreateSchedule(
                   1, "Л",
                   "Оптимизация и математические методы принятия решений",
                   "Воропаев А.Н.",
                   "лаб", 239, 1,
                   "22308",
                   "1",
                   2, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Ч",
                   "Оптимизация и математические методы принятия решений",
                   "Сошкин Р.В.",
                   "л", 427, 1,
                   "22308",
                   "1",
                   2, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "З",
                   "Оптимизация и математические методы принятия решений",
                   "Воропаев А.Н.",
                   "п", 265, 1,
                   "22308",
                   "1",
                   2, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Иностранный язык в сфере профессиональной коммуникации",
                   "Миранцова А.В.",
                   "п", 265, 1,
                   "22308",
                   "1",
                   2, 5,//day, period
                   1, 1, 0
               ));

                //day3-----------------------------------------
                //day4-----------------------------------------
                result.Add(CreateSchedule(
                   1, "З",
                   "Прикладная статистика",
                   "Кондратьев Ю.Н.",
                   "лаб", 241, 1,
                   "22308",
                   "1",
                   4, 2,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "З",
                   "Прикладная статистика",
                   "Кондратьев Ю.Н.",
                   "лаб", 241, 1,
                   "22308",
                   "1",
                   4, 3,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Прикладная статистика",
                   " ",
                   "л", 427, 1,
                   "22308",
                   "1",
                   4, 4,//day, period
                   1, 1, 0
               ));
                result.Add(CreateSchedule(
                   1, "Л",
                   "Моделирование и анализ бизнес-процессов",
                   "Сенькина Я.В.",
                   "л", 412, 1,
                   "22308",
                   "1",
                   4, 5,//day, period
                   1, 1, 0
               ));
                //day5-----------------------------------------
                result.Add(CreateSchedule(
                  1, "Л",
                  "Информационная безопасность и защита информации",
                  "Балашов С.Г.",
                  "лаб", 241, 1,
                  "22308",
                  "1",
                  5, 3,//day, period
                  1, 1, 0
              ));
                result.Add(CreateSchedule(
                  1, "Л",
                  "Web - технологии",
                  "Бородина А.В.",
                  "л", 146, 1,
                  "22308",
                  "1",
                  5, 4,//day, period
                  1, 1, 0
              ));
                result.Add(CreateSchedule(
                  1, "Л",
                  "Web - технологии",
                  "Бородина А.В.",
                  "лаб", 435, 1,
                  "22308",
                  "1",
                  5, 5,//day, period
                  1, 1, 0
              ));
                //day6-----------------------------------------
                result.Add(CreateSchedule(
                  1, "Л",
                  "Информационная безопасность и защита информации",
                  " ",
                  "л", 427, 1,
                  "22308",
                  "1",
                  6, 3,//day, period
                  1, 1, 0
              ));
            }

            if (g.Id == 22101)
            {
                //day1----------------------------------------
                result.Add(CreateSchedule(
                  1, "Л",
                  "Физическая культура",
                  "Неповинных Л.А.",
                  "п", -1, 1,
                  "22101",
                  "1",
                  1, 1,//day, period
                  1, 1, 0
              ));
               result.Add(CreateSchedule(
                  1, "Ч",
                  "Иностранный язык",
                  "Копцева Т.А.",
                  "п", 353, 1,
                  "22101",
                  "1",
                  1, 3,//day, period
                  1, 1, 0
              ));
               result.Add(CreateSchedule(
                 1, "З",
                 "Иностранный язык",
                 "Копцева Т.А.",
                 "п", 407, 1,
                 "22101",
                 "1",
                 1, 3,//day, period
                 1, 1, 0
             ));
               result.Add(CreateSchedule(
                 1, "Л",
                 "Математический анализ",
                 "Шестаков В.А.",
                 "л", 274, 1,
                 "22101",
                 "1",
                 1, 4,//day, period
                 1, 1, 0
             ));
               result.Add(CreateSchedule(
                 1, "Л",
                 "Дифференциальная геометрия и топология",
                 "Иванов А.В.",
                 "л", 274, 1,
                 "22101",
                 "1",
                 1, 5,//day, period
                 1, 1, 0
             ));
               result.Add(CreateSchedule(
                 1, "Л",
                 "Дифференциальная геометрия и топология",
                 "Иванов А.В. ",
                 "п", 274, 1,
                 "22101",
                 "1",
                 1, 6,//day, period
                 1, 1, 0
             ));
                //day2----------------------------------------
               result.Add(CreateSchedule(
                1, "Л",
                "Иностранный язык",
                "Железовская Ю.В.",
                "п", 444, 1,
                "22101",
                "1",
                2, 4,//day, period
                1, 1, 0
            ));
               result.Add(CreateSchedule(
               1, "Л",
               "Дифференциальные уравнения",
               "Заика Ю.В.",
               "л", 274, 1,
               "22101",
               "1",
               2, 5,//day, period
               1, 1, 0
           ));
               result.Add(CreateSchedule(
               1, "Л",
               "Математический анализ",
               "Ганенкова Е.Г.",
               "п", 258, 1,
               "22101",
               "1",
               2, 6,//day, period
               1, 1, 0
           ));
                //day3---------------------------------------
               result.Add(CreateSchedule(
             1, "Л",
             "Информатика",
             "Будникова Н.А.",
             "лаб", 435, 1,
             "22101",
             "1",
             3, 3,//day, period
             1, 1, 0
         ));
               result.Add(CreateSchedule(
           1, "Л",
           "Компьютерные технологии в математике",
           "Воропаев А.Н.",
           "лаб", 341, 1,
           "22101",
           "1",
           3, 4,//day, period
           1, 1, 0
       ));
               result.Add(CreateSchedule(
           1, "Л",
           "Теория вероятностей и математическая статистика",
           "Павлов Ю.Л.",
           "л", 271, 1,
           "22101",
           "1",
           3, 5,//day, period
           1, 1, 0
       ));
               result.Add(CreateSchedule(
           1, "Л",
           "Математический анализ",
           "Шестаков В.А.",
           "л", 274, 1,
           "22101",
           "1",
           3, 6,//day, period
           1, 1, 0
       ));
                //day4----------------------------------------
               result.Add(CreateSchedule(
          1, "Л",
          "Компьютерные технологии в математике",
          "Воропаев А.Н.",
          "лаб", 341, 1,
          "22101",
          "1",
          4, 4,//day, period
          1, 1, 0
      ));
               result.Add(CreateSchedule(
          1, "Ч",
          "Информатика",
          "Будникова Н.А.",
          "л", 404, 1,
          "22101",
          "1",
          4, 5,//day, period
          1, 1, 0
      ));
               result.Add(CreateSchedule(
          1, "З",
          "Компьютерные технологии в математике",
          "Воропаев А.Н.",
          "л", 404, 1,
          "22101",
          "1",
          4, 5,//day, period
          1, 1, 0
      ));
               result.Add(CreateSchedule(
          1, "Л",
          "Иностранный язык",
          "Железовская Ю.В.",
          "п", 407, 1,
          "22101",
          "1",
          4, 6,//day, period
          1, 1, 0
      ));
                //day5----------------------------------------
               result.Add(CreateSchedule(
     1, "Л",
     "Теория вероятностей и математическая статистика",
     "Смирнов Н.В. ",
     "п", 265, 1,
     "22101",
     "1",
     5, 4,//day, period
     1, 1, 0
 ));
               result.Add(CreateSchedule(
     1, "Л",
     "Математический анализ",
     "Ганенкова Е.Г.",
     "п", 347, 1,
     "22101",
     "1",
     5, 5,//day, period
     1, 1, 0
 ));
               result.Add(CreateSchedule(
     1, "Л",
     "Дифференциальные уравнения",
     "Заика Ю.В.",
     "п", 274, 1,
     "22101",
     "1",
     5, 6,//day, period
     1, 1, 0
 ));
                //day6----------------------------------------
            }

            return result.ToArray();
        }

        public Schedule CreateSchedule(
            int Id,
            string wt,
            string TutorialName,
            string LecturerName,
            string TutorialType,
            int AudId,
            int BuildId,
            string GroupIds,
            string CourseIds,
            int Day,
            int PeriodId,
            int hours,
            int StudyYearId,
            int SemesterId
            ){
                var s1 = new Schedule();
                s1.Id = Id;
                if (AudId != -1)
                {
                    var aController = new AuditoriumController();
                    s1.Auditorium = new Auditorium();

                    if (TutorialType == "л")
                    {
                        s1.Auditorium = aController.CreateAuditorium(AudId, 1, BuildId);
                    }
                    if (TutorialType == "лаб")
                    {
                        s1.Auditorium = aController.CreateAuditorium(AudId, 2, BuildId);
                    }
                    if (TutorialType == "п")
                    {
                        s1.Auditorium = aController.CreateAuditorium(AudId, 4, BuildId);
                    }
                }

                s1.Period = new Time();
                if (PeriodId == 1)
                    s1.Period.Id = 12;
                if (PeriodId == 2)
                    s1.Period.Id = 13;
                if (PeriodId == 3)
                    s1.Period.Id = 14;
                if (PeriodId == 4)
                    s1.Period.Id = 15;
                if (PeriodId == 5)
                    s1.Period.Id = 16;
                if (PeriodId == 6)
                    s1.Period.Id = 17;
                if (PeriodId == 7)
                    s1.Period.Id = 33;

                s1.WeekType = new WeekType();
                if(wt == "Л"){
                    s1.WeekType.Id = 1;
                    s1.WeekType.Name = "Е.";
                }

                if(wt == "Ч"){
                    s1.WeekType.Id = 2;
                    s1.WeekType.Name = "Ч.";
                }

                if(wt == "З"){
                    s1.WeekType.Id = 3;
                    s1.WeekType.Name = "З.";
                }

                s1.DayOfWeek = Day;
                s1.ScheduleInfo = new ScheduleInfo();

                s1.ScheduleInfo.Id = Id;

                
                s1.ScheduleInfo.Semester = SemesterId;
                s1.ScheduleInfo.StudyYear = new StudyYear();
                s1.ScheduleInfo.StudyYear.Id = StudyYearId;
                s1.ScheduleInfo.Tutorial = new Tutorial();
                s1.ScheduleInfo.Tutorial.Id = Id;
                s1.ScheduleInfo.Tutorial.Name = TutorialName;

               s1.ScheduleInfo.TutorialType = new TutorialType();

                if(TutorialType == "л"){
                    s1.ScheduleInfo.TutorialType.Id = 1;
                    s1.ScheduleInfo.TutorialType.Name = "Лекция";
                }
                if (TutorialType == "лаб")
                {
                    s1.ScheduleInfo.TutorialType.Id = 2;
                    s1.ScheduleInfo.TutorialType.Name = "Лабораторная";
                }
                if (TutorialType == "п")
                {
                    s1.ScheduleInfo.TutorialType.Id = 3;
                    s1.ScheduleInfo.TutorialType.Name = "Практика";
                }

                var courses = new List<Course>();
                foreach (var courseId in CourseIds.Split(new[] { ',' }, StringSplitOptions.RemoveEmptyEntries))
                {
                    if (courseId != " ")
                    {
                        int icourseId = int.Parse(courseId);
                        var c = new Course();
                        c.Id = icourseId;
                        courses.Add(c);
                    }
                }

                s1.ScheduleInfo.Courses = courses.ToArray();

                var groups = new List<Group>();
                foreach (var gId in GroupIds.Split(new[] { ',' }, StringSplitOptions.RemoveEmptyEntries))
                {
                    if (gId != " ")
                    {
                        int igId = int.Parse(gId);
                        var g = new Group();
                        g.Id = igId;
                        g.Code = igId.ToString();
                        groups.Add(g);
                    }
                }

                s1.ScheduleInfo.Lecturer = new Lecturer();
                s1.ScheduleInfo.Lecturer.Id = Id;
                s1.ScheduleInfo.Lecturer.Lastname = LecturerName;
                s1.ScheduleInfo.Lecturer.Middlename = "";
                s1.ScheduleInfo.Lecturer.Firstname = "";
               

                s1.ScheduleInfo.Groups = groups.ToArray();

                return s1;
        }
    }
}